Revit 2027 API
BuiltInFailures.RebarFailures.NoRebarSelected Property
 At least one Rebar should be selected.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoRebarSelected { get; }
Public Shared ReadOnly Property NoRebarSelected As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoRebarSelected {
	FailureDefinitionId^ get ();
}
static member NoRebarSelected : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace